//Напиши скрипт з наступним функціоналом:

// При завантаженні сторінки користувачеві пропонується в prompt ввести число. Введення зберігається в змінну input і додається в масив чисел numbers.
// Операція введення числа користувачем і збереження в масив триває до тих пор, пір, поки користувач не натисне Cancel в prompt.
// Після того як користувач припинив введення натиснувши Cancel, якщо масив не порожній, необхідно порахувати суму всіх елементів масиву і записати її в змінну total. Використовуй цикл for або for...of. Після чого в консоль виведи рядок 'Загальна сума чисел дорівнює [сума]'.

// 1
let input;
const numbers = [];

let total = 0;
// 2
while (true) {
  input = prompt("введіть число");
  numbers.push(Number(input));
  if (input === null) {
    //3
    for (const add of numbers) {
      total += add;
    }
    break;
  }
}

console.log(total);
